[M_Orchid_BuryingThePast MissionDefinition]
MissionName="Leave the past behind"
MissionDescription="Aubrey Callahan III is the granddaughter of a dangerous pirate queen. As you can imagine, this incident can seriously damage your reputation and job prospects. This is why Aubrey hired him to destroy Cronus, his grandfather's ship, and all evidence of the killer.."
TurnInDescription="Now that Lola has been removed from the story, Aubrey can live a normal life without the "news" and the "kids".'."
MissionSummary="Simultaneous time."
MissionGiver="Oasis price panel"
MissionTurnInLocation="Oasis Sports Dashboard"
TeaserText="This policy continues to explode."

[M_Orchid_BuryingThePast:DestroyShip MissionObjectiveDefinition]
ProgressMessage="Kronos is tearing up."

[M_Orchid_BuryingThePast:DestroyShipSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_BuryingThePast:GetExplosives MissionObjectiveDefinition]
ProgressMessage="Defense against explosives"

[M_Orchid_BuryingThePast:GetExplosivesSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_BuryingThePast:PlantExplosives MissionObjectiveDefinition]
ProgressMessage="Bomb blast."

[M_Orchid_BuryingThePast:PlantExplosivesSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

